collab.channel.output/src/org/netbeans/modules/collab/channel/output/resources/message_append.xml

<!--
The contents of this file are subject to the terms of the Common Development
and Distribution License (the License). You may not use this file except in
compliance with the License.

You can obtain a copy of the License at http://www.netbeans.org/cddl.html
or http://www.netbeans.org/cddl.txt.

When distributing Covered Code, include this CDDL Header Notice in each file
and include the License file at http://www.netbeans.org/cddl.txt.
If applicable, add the following below the CDDL Header, with the fields
enclosed by brackets [] replaced by your own identifying information:
"Portions Copyrighted [year] [name of copyright owner]"

The Original Software is NetBeans. The Initial Developer of the Original
Software is Sun Microsystems, Inc. Portions Copyright 1997-2006 Sun
Microsystems, Inc. All Rights Reserved.
-->

<soap:Envelope
	xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
	xmlns:moxc="http://www.netbeans.org/ns/moxc/1_0">
	<soap:Header>
		<moxc:message soap:mustUnderstand="true">
            <moxc:sender>__sender__</moxc:sender>
            <moxc:conversation>__conversation__</moxc:conversation>
            <moxc:channel>__uri__</moxc:channel>
            <moxc:instance>__instance__</moxc:instance>
		</moxc:message>
	</soap:Header>
	<soap:Body>
		<share-output:append xmlns:share-output="__uri__">
			<share-output:instance_id>__output_instance_id__</share-output:instance_id>
			<share-output:content contentType="text/plain">
				__output_content__
			</share-output:content>
		</share-output:append>
	</soap:Body>
</soap:Envelope>
